//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
#ifndef _MOD_STORAGE_H
#define _MOD_STORAGE_H
//------------------------------------------------------------------------------
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
typedef struct
{
    INT32U buinf_update_sign;//标识
    INT32U buinf_checkSum;//校验和
    INT32U buinf_prgSize_byte;//程序字节数
}backup_updateInf_def;
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//------------------------------------------------------------------------------
//Event
//------------------------------------------------------------------------------
//Status
//------------------------------------------------------------------------------
//Function
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//EEPROM interface
//------------------------------------------------------------------------------
//名称:内置EEPROM Flash初始化配置
//入口:
//      _In_StoLength ,应用存储体长度,(0...126)   <<--- 传入

void StoRunParameter_Configure(INT8U _In_StoLength);
//------------------------------------------------------------------------------
//名称:读取内置EEPROM Flash，按块的方式读取
//入口:
//      _Out_pRamAddr ,读取数据的内存指针,        --->> 传出
//出口:失败标识  BN_TRUE---读取失败

BOOLEAN ReadFlash_StoRunParameter(INT8U* _Out_pRamAddr);
//------------------------------------------------------------------------------
//名称:写入内置EEPROM Flash，按块的方式写入
//入口:
//      _In_pRamAddr ,写入数据的内存指针,        <<--- 传入

void WriteFlash_StoRunParameter(INT8U* _In_pRamAddr);
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//flash updata area interface
//------------------------------------------------------------------------------
//名称: 写入Flash一个块的数据
//功能: 
//入口:   in_number_block   块序号 0...
//        in_pData          升级数据
//出口: 无

void WriteOneBlockOfUpdate(INT16U in_number_block,INT8U* in_pData);

//------------------------------------------------------------------------------
//名称: 读取信息数据
//功能: 获取升级信息
//入口: out_information    信息内容指针
//           
//出口: 
void ReadFlash_InfUpdate(backup_updateInf_def* out_pInformation);
//------------------------------------------------------------------------------
//名称: 写入升级信息数据
//功能: 写入升级信息
//入口: in_information    信息内容
//           
//出口: 无
void WriteFlash_InfUpdate(backup_updateInf_def in_information);
//------------------------------------------------------------------------------
//名称: 校验程序数据是否合法
//功能: 校验备份区的程序代码是否合法
//入口: 无
//           
//出口: BN_TRUE 合法

BOOLEAN checkPrgDataLegalIsOk(void);
//------------------------------------------------------------------------------

//------------------------------------------------------------------------------
//名称: 生成校验文算法
//功能: 生成信息的校验文
//入口: pData    信息内容指针，Length 信息长度
//           
//出口: 32bit的校验文
INT32U MakeCheckSumText(INT8U* pData,INT32U Length);

//------------------------------------------------------------------------------

void mod_sto_configure(INT8U eepromLength);
BOOLEAN mod_sto_readStoPara(INT8U *_out_dat);
void mod_sto_writeStoPara(INT8U *dat);

//------------------------------------------------------------------------------
//------------------------------------------------------------------------------


//------------------------------------------------------------------------------
//------------------------------------------------------------------------------
#endif
//++++++++++++++++++++++++++++++++++End+++++++++++++++++++++++++++++++++++++++++