//++++++++++++++++++++++++++++++start+++++++++++++++++++++++++++++++++++++++++++
#ifndef _BSP_LCD_H
#define _BSP_LCD_H
//------------------------------E N D-------------------------------------------


//++++++++++++++++++++++++++++++start+++++++++++++++++++++++++++++++++++++++++++
#ifndef  __Snail_DataRetype__
#include ".\SnailDataTypedef.h"
#endif

#if defined(__STM8L052R8__)
#include "iostm8l052r8.h"
#define MUC_RAM_ADDRESS    LCD_RAM0
#endif



//------------------------------E N D-------------------------------------------
//++++++++++++++++++++++++++++++start+++++++++++++++++++++++++++++++++++++++++++
//Init
//名称:  液晶模块初始化
//功能:  
//入口:  无
//出口:  无
void bsp_lcd_configure(void);
//------------------------------E N D-------------------------------------------
void bsp_refresh_lcd(uint8_t *ptbuf,uint8_t len);

#endif




//-----------------------BSP_Keyboard.h--END------------------------------------
