/*******************************************************************************
*
*	模块名称 : Mod背光模块
*	文件名称 : Mod_Backlight.c
*	版    本 : V1.0
*	说    明 : 1、模块独立，不主动访问其他模块。
                   2、映射BSP中的文件供其他函数调用
	           
*	修改记录 :
*		版本号  日期        作者     说明
*		V1.0    2018-07-06  zhoujh  正式发布
*	Copyright (C), 2015-2022,   menredGroup
*
*******************************************************************************/




//-----------------------Mod_Backlight.c--END------------------------------------



