/*******************************************************************************
*
*	模块名称 : ADC按键模块
*	文件名称 : BSP_ADC_NTC.c
*	版    本 : V1.0
*	说    明 : 1、模块独立，不访问其他任何模块
*                  2、 
                   3、 
*	修改记录 :
*		版本号  日期        作者     说明
*		V1.0   2018-07-12  jinzh 正式发布
*	Copyright (C), 2015-2020,   menredGroup
*       编译环境 ：IAR FOR STM8 V2.2      
*******************************************************************************/
//++++++++++++++++++++++++++++++start+++++++++++++++++++++++++++++++++++++++++++
#include "..\..\Mod_ADC12\Src\Mod_ADC_NTC.h"
//------------------------------E N D-------------------------------------------

//++++++++++++++++++++++++++++++start+++++++++++++++++++++++++++++++++++++++++++
void main(void)
{
    
    INT16U Adc_AvgValue;
    BSP_ADC_IO_Configure();          //IO初始化
    BSP_ADC_HardwareConfigure();     //ADC硬件初始化
        
    while(1)
    {
       ADC_ScanTask();              //ADC任务扫描
       if(Mod_Adc_FinishEvent())
       {
         Mod_Adc_GetTemp(); //返回16次平均值
         Mod_SearchNTCTable(Adc_AvgValue);   //转换成温度值 
       }
       
    }    
   
}
//------------------------------E N D-------------------------------------------

//--------------------------Backlight.c--END------------------------------------