//++++++++++++++++++++++++++++++start+++++++++++++++++++++++++++++++++++++++++++
#ifndef _MOD_INTERVAL_H
#define _MOD_INTERVAL_H
//------------------------------E N D-------------------------------------------

//++++++++++++++++++++++++++++++start+++++++++++++++++++++++++++++++++++++++++++
//Function
//名称: 设置背光点亮时间
//功能: 点亮背光
//入口: _in_secondLedOn  背光点亮时间，秒级  <<-------------------------传入
//出口: 无
//void mod_backLight_on(INT16U _in_secondLedOn);

//++++++++++++++++++++++++++++++start+++++++++++++++++++++++++++++++++++++++++++
//task
//名称: 背光任务
//功能: 定时扫描，确定背光是否点亮
//入口: _in_msTick 扫描周期，毫秒级 <<-----------------------------------传入
//出口: 无
//void mod_backLight_task(INT16U _in_msTick);
#endif
//-----------------------Mod_Backlight.h--END-----------------------------------
