//++++++++++++++++++++++++++++++start+++++++++++++++++++++++++++++++++++++++++++
#ifndef _BSP_RELAYPWM_H
#define _BSP_RELAYPWM_H
//------------------------------E N D-------------------------------------------


//++++++++++++++++++++++++++++++start+++++++++++++++++++++++++++++++++++++++++++
#ifndef  Data_Retyped
#include ".\DataTypedef.h"
#endif

#ifndef  _MOD_SYSTEMTICK_H
#include "..\..\Mod_Systemtick\Src\Mod_SystemTick.h"
#endif

//------------------------------E N D-------------------------------------------


//++++++++++++++++++++++++++++++start+++++++++++++++++++++++++++++++++++++++++++
//**************************秒的延时宏定义***************************************
#define Time_60_Second   60
#define Time_1_Second    1
#define Time_2_Second    2
#define Time_5_Second    5
//------------------------------E N D-------------------------------------------


//++++++++++++++++++++++++++++++start+++++++++++++++++++++++++++++++++++++++++++
//Function
//名称: 使能输出继电器1-3.
//功能: 继电器PWM输出控制

//入口: 状态   BN_TURE使能相应端口 BN_FLASE关闭相应端口
//      _In_NewStatus<<-------------------------传入

//出口: 无
void BSP_Relay1_OutStatus(BOOLEAN _In_NewStatus);
void BSP_Relay2_OutStatus(BOOLEAN _In_NewStatus);
void BSP_Relay3_OutStatus(BOOLEAN _In_NewStatus);
//------------------------------E N D-------------------------------------------

//++++++++++++++++++++++++++++++start+++++++++++++++++++++++++++++++++++++++++++
//Function
//名称: 配置PWM全输出
//功能: 

//入口: 无
//出口: 无
void BSP_RelayPWM_Set_100Percent_Out(void);
//------------------------------E N D-------------------------------------------


//++++++++++++++++++++++++++++++start+++++++++++++++++++++++++++++++++++++++++++
//Function
//名称: 配置PWM全输出
//功能: 

//入口: 无
//出口: 无
void BSP_RelayPWM_Set_60Percent_Out(void);
//------------------------------E N D-------------------------------------------


//++++++++++++++++++++++++++++++start+++++++++++++++++++++++++++++++++++++++++++
//Init
//名称: IO和TIM1配置
//功能: 配置IO为推挽，配置TIM1为PWM3路输出
//入口: 无
//出口: 无
void BSP_RelayAndPWM_Configure(void);
//------------------------------E N D-------------------------------------------

#endif

//-----------------------BSP_RelayPWM.h--END------------------------------------
