//++++++++++++++++++++++++++++++start+++++++++++++++++++++++++++++++++++++++++++
#ifndef _APP_RELAY_H
#define _APP_RELAY_H
//------------------------------E N D-------------------------------------------
//++++++++++++++++++++++++++++++start+++++++++++++++++++++++++++++++++++++++++++
//Task
//名称: 继电器输出控制扫描任务
//功能: 
//入口: 无
//出口: 无
void app_relayOut_scanTask(void);
//------------------------------E N D-------------------------------------------
//Task
//名称: 查询继电器外限温功能
//功能: 
//入口: 无
//出口: true 外限温起作用  false 外限温不起作用
bool relay_out_limitFlag(void);
#endif



//--------------------------APP.ThreeFanOut.h--END--------------------------------------