//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
#ifndef _BSP_SLAVEUART_H
#define _BSP_SLAVEUART_H
//-----------------------------------------------------------------------------
#ifndef  Data_Retyped
#include ".\DataTypedef.h"
#endif
#include "..\..\Mod_Systemtick\Src\Mod_SystemTick.h"
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++


//++++++++++++++++++++++++++++++start+++++++++++++++++++++++++++++++++++++++++++
//Function
//名称: 串口3、TIM4和RS485通信配置
//功能: 给Mod模块的ReStart状态使用，触发条件有软件超时、硬件超时、波特率和校验位      
//入口: 波特率和校验方式
//                                  19200  9600  4800  2400
//波特率    INT16U _In_Baudrate     <<--------------------------------------传入 
//                                   0x00 无检验  0x01偶校验  0x02奇校验
//校验方式  INT8U _In_ParitySelect  <<--------------------------------------传入
//主频      INT32U  _In_CLK         <<--------------------------------------传入
//                                   0x00 1T停止位 0x01 1.5T停止位 0x02 2T停止位
//停止位    INT8U   _In_StopBits    <<--------------------------------------传入
//出口: 无
void BSP_Usart3_Configure(INT16U _In_Baudrate,INT8U _In_ParitySelect,INT32U _In_CLK,INT8U _In_StopBits);//重启Usart3
//------------------------------E N D-------------------------------------------

//++++++++++++++++++++++++++++++start+++++++++++++++++++++++++++++++++++++++++++
//Event
//名称: BSP事件中心
//功能: 获取发送或者接收完成事件      
//入口: 事件名称
//                                      0x00获取接收完成 0xff获取发送完成
//事件名称    BOOLEAN _In_EventType   <<--------------------------------------传入 
//                                      使用者最好在使用的文件内宏定义

//出口: BN_TURE代表相应事件发生

BOOLEAN BSP_ModbusGetEventCentre(BOOLEAN EventType);
//------------------------------E N D-------------------------------------------


//++++++++++++++++++++++++++++++start+++++++++++++++++++++++++++++++++++++++++++
//Function
//名称: 数据传输
//功能: 将BSP收据的RX上传到Mod。     
//入口: 数据指针                            第0位是数据长度
//           INT8U *_InOut_buff   -------------------------------------->>
        
//出口: BN_TURE代表传输完成，无BN_FLASE

BOOLEAN BSP_ModbusDateTransmit_BSP_Mod(INT8U *_Out_buff);
//------------------------------E N D-------------------------------------------


//++++++++++++++++++++++++++++++start+++++++++++++++++++++++++++++++++++++++++++
//Function
//名称: 数据传输
//功能: 将Mod解析好的的TX下传到BSP。     
//入口: 数据指针                            第0位是数据长度
//           INT8U *_In_buff     <<--------------------------------------
        
//出口: BN_TURE代表传输完成，无BN_FLASE

BOOLEAN BSP_ModbusDateTransmit_Mod_BSP(INT8U *_In_buff);
//------------------------------E N D-------------------------------------------


//++++++++++++++++++++++++++++++start+++++++++++++++++++++++++++++++++++++++++++
//Function
//名称: TX开启
//功能: 开启RS485发送功能和中断。     
//入口: 无
//出口: 无
void BSP_StartTx(void);
//------------------------------E N D-------------------------------------------


//++++++++++++++++++++++++++++++start+++++++++++++++++++++++++++++++++++++++++++
//Function
//名称: RX开启
//功能: 开启RS485接收功能和中断。     
//入口: 无
//出口: 无
void BSP_StartRx(void);
//------------------------------E N D-------------------------------------------

#endif
//++++++++++++++++++++++++++++++++++End++++++++++++++++++++++++++++++++++++++++