/*******************************************************************************
*
*	模块名称 : 输出控制
*	文件名称 : app_timming.c
*	版    本 : V1.0
*	说    明 : 
*                  
*                 
*	修改记录 :
*		版本号  日期        作者     说明
*		V1.0    2018-09-21  zhoujh&Linzl  正式发布
*	Copyright (C), 2015-2022,   menredGroup
*
*******************************************************************************/


//++++++++++++++++++++++++++++++start+++++++++++++++++++++++++++++++++++++++++++
#include ".\APP_Cfg.h"



void app_timing_halfHour_handle(void)
{
    
}

void app_timming_scanTask(void)
{
    
}




