//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
#ifndef _APP_STORAGE_H
#define _APP_STORAGE_H
//-----------------------------------------------------------------------------

#define FAC_BACKLIGHT_WORK_TIME 1

//++++++++++++++++++++++++++++++start+++++++++++++++++++++++++++++++++++++++++++
//***************************状态字类型*****************************************
enum
{
     StatusShutDown       = 0x0001,  //关机
     StatusAuto           = 0x0010,  //自动，非自动就是手动
     StatusDayProOn       = 0x0040,  //自动编程模式开
     StatusChangStrainer  = 0x0800,  //更换滤网
};
//------------------------------E N D-------------------------------------------



//++++++++++++++++++++++++++++++start+++++++++++++++++++++++++++++++++++++++++++
//*************************存储模块读写状态**************************************
typedef enum
{
    StoFree   = 0x00,
    StoWrite  = 0x01,
    StoRead   = 0x02,
}APP_StoDDR_Def;
//------------------------------E N D-------------------------------------------



//++++++++++++++++++++++++++++++start+++++++++++++++++++++++++++++++++++++++++++
//***************************风机档位类型***************************************
typedef enum
{
    TwoSpeed           =0x00,  //2速
    ThreeSpeed         =0x01,  //3速
}FanGearsSelect_Def;
//------------------------------E N D-------------------------------------------



//++++++++++++++++++++++++++++++start+++++++++++++++++++++++++++++++++++++++++++
//***************************风机风速类型***************************************    
typedef enum
{
    SpeedNo            =0x00,  //无风
    SpeedLow           =0x01,  //低风
    SpeedMid           =0x02,  //中风
    SpeedHigh          =0x03,  //高风
}FanWorkSpeed_Def;
//------------------------------E N D-------------------------------------------






//++++++++++++++++++++++++++++++start+++++++++++++++++++++++++++++++++++++++++++
//*************************RS485参数类型****************************************
typedef struct
{
    INT8U             SlaveAddress;
    INT16U            Baudrate;
    Parity_Def        Parity;
    StopBits_Def      StopBits;
}Rs485Para_Def;
//------------------------------E N D-------------------------------------------



//++++++++++++++++++++++++++++++start+++++++++++++++++++++++++++++++++++++++++++
//*************************滤网清理参数类型**************************************
typedef struct
{
    INT32U         RunCleanMinite;   
    INT32U         SetCleanDay;
}CleanPara_Def;
//------------------------------E N D-------------------------------------------



//++++++++++++++++++++++++++++++start+++++++++++++++++++++++++++++++++++++++++++
//**************************天编程参数类型**************************************
typedef struct
{
    INT8U        StartHour;
    INT8U        StopHour;
}DayProPara_Def;
//------------------------------E N D-------------------------------------------



//++++++++++++++++++++++++++++++start+++++++++++++++++++++++++++++++++++++++++++
//*************************存储模块参数类型**************************************
typedef union
{
    INT8U data[12];
    struct
    {
        INT16U                DeviceStatusBits;        //设备状态字
        INT16S                CalibrateTemperature;    //校温值       
        INT8U                 BacklightTimeWorkTime;   //背光工作时间
        DayProPara_Def        DayProPara;              //天编程参数
        CleanPara_Def         CleanPara;               //滤网清理参数
        FanWorkSpeed_Def      FanHandWorkSpeed;        //手动风速
        FanGearsSelect_Def    FanGearsSelect;          //风机档数选择
        Rs485Para_Def         Rs485Para;               //Rs485参数
    };
}APP_StorageParameter_Def;
//------------------------------E N D-------------------------------------------



//++++++++++++++++++++++++++++++start+++++++++++++++++++++++++++++++++++++++++++
//Function
//名称: 传出存储模块参数首地址
//功能: 给其他模块需要存储参数的模块使用
//入口: 无

//出口:  APP_StorageParameter_Def指针
APP_StorageParameter_Def *APP_Storage_PutOutParameter(void);
//------------------------------E N D-------------------------------------------



//++++++++++++++++++++++++++++++start+++++++++++++++++++++++++++++++++++++++++++
//Function
//名称: 压入存储模块参数
//功能: 供应其他模块修改存储模块参数
//入口: 结构体指针 *_In_me <<-----------------------------------传入

//出口: 无
void APP_Storage_PutInPara(void);
//------------------------------E N D-------------------------------------------



//++++++++++++++++++++++++++++++start+++++++++++++++++++++++++++++++++++++++++++
//Init
//名称: 存储模块初始化
//功能: 主函数大循环前调用
//入口: 无
//出口: 无
void APP_Sto_Configure(void);
//------------------------------E N D-------------------------------------------



//++++++++++++++++++++++++++++++start+++++++++++++++++++++++++++++++++++++++++++
//Task
//名称: 存储模块扫描
//功能: 主函数调用，定时读写。
//入口: 无
//出口: 无
void APP_Sto_ScanTask(void);
//------------------------------E N D-------------------------------------------


#endif


//--------------------------APP_Storage.h--END----------------------------------