//++++++++++++++++++++++++++++++start+++++++++++++++++++++++++++++++++++++++++++
#ifndef _MOD_ADC_NTC_H
#define _MOD_ADC_NTC_H
//------------------------------E N D-------------------------------------------

//++++++++++++++++++++++++++++++start+++++++++++++++++++++++++++++++++++++++++++
#include "..\Depend\BSP_ADC_NTC.h"
//------------------------------E N D-------------------------------------------

/*typedef enum
{
    B_3380_10K       =0,   //B=3380  (25/50)
    B_3950_10K       =1,
}SensorType_Def;*/
   
typedef enum
{
    Adc_Init       = 0x00,   //ADC初始化
    Adc_Channal    = 0x01,   //通道选择
    Adc_Convert    = 0x02,   //开启ADC
    Adc_Wait       = 0x03,
}Mod_AdcTaskSatus_Def;

typedef enum
{
    None       =0x00,   
    Finish     =0x01,
}Mod_AdcEvent_Def;
  
//++++++++++++++++++++++++++++++start+++++++++++++++++++++++++++++++++++++++++++    
//++++++++++++++++++++++++++++++start+++++++++++++++++++++++++++++++++++++++++++
//供对应的mod_Adc_ntc函数调用，下方有函数详解，用IDE的搜索功能可快速找到当前函数的注释。
//INT16U Mod_Adc_GetTemp(void);
//BOOLEAN Mod_Adc_FinishEvent(void);
//void ADC_ScanTask(void);
//INT16S Mod_SearchNTCTable(INT16U Adc_AvgValue);
//------------------------------E N D-------------------------------------------

//++++++++++++++++++++++++++++++start+++++++++++++++++++++++++++++++++++++++++++
//名称: ADC 转换结果配置
//功能: 
//入口: 
//
//出口: AD转换后的值
INT16U Mod_Adc_GetTemp(void);
//------------------------------E N D-------------------------------------------

//++++++++++++++++++++++++++++++start+++++++++++++++++++++++++++++++++++++++++++
//名称: ADC 转换结果配置
//功能: 转换完成
//入口: 
//
//出口: 完成OR位完成
BOOLEAN Mod_Adc_FinishEvent(void);
//------------------------------E N D-------------------------------------------

//++++++++++++++++++++++++++++++start+++++++++++++++++++++++++++++++++++++++++++
//名称: ADC 转换结果配置
//功能: ADC扫描程序
//入口: 
//
//出口: 
void ADC_ScanTask(void);
//------------------------------E N D-------------------------------------------
//++++++++++++++++++++++++++++++start+++++++++++++++++++++++++++++++++++++++++++
//名称: ADC 转换结果配置
//功能: 
//入口: ADC值，
//
//出口: 温度值,有符号数
INT16S Mod_SearchNTCTable(INT16U Adc_AvgValue);
//------------------------------E N D-------------------------------------------
#endif
//-----------------------Mod_ADC_NTC.h--END-----------------------------------

