
/*******************************************************************************
*
*	模块名称 : ADC按键模块
*	文件名称 : BSP_ADC_NTC.c
*	版    本 : V1.0
*	说    明 : 1、模块独立，不访问其他任何模块
*                  2、 
                   3、 
*	修改记录 :
*		版本号  日期        作者     说明
*		V1.0   2018-07-12  jinzh 正式发布
*	Copyright (C), 2015-2020,   menredGroup
*       编译环境 ：IAR FOR STM8 V2.2      
*******************************************************************************/

//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//        VCC
//         |
//        |-|  Pullup
//        |-|
//         |-------->AIN
//        |-|  
//        |-|  NTC Sensor
//         |
//        GND
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//++++++++++++++++++++++++++++++start+++++++++++++++++++++++++++++++++++++++++++
#include "DataTypedef.h"
#include "iostm8l052r8.h"
#include "intrinsics.h"
#include "DeviceType_Slt.h"
//------------------------------E N D-------------------------------------------
//宏定义ADC IO管脚寄存器宏定义

#define AD_PIN_ODR4   PC_ODR_ODR4   //NO USED
#define AD_PIN_IDR4   PC_IDR_IDR4  
#define AD_PIN_DDR4   PC_DDR_DDR4
#define AD_PIN_CR14   PG_CR1_C14    //USE AD4
#define AD_PIN_CR24   PG_CR2_C24    //NO USED

//------------------------------E N D-------------------------------------------

//++++++++++++++++++++++++++++++start+++++++++++++++++++++++++++++++++++++++++++
//配置PC4口为推挽,IO初始化 输入模式
//-----------------------------------------------------------------------------
void BSP_ADC_IO_Configure(void)
{
   // PC_IDR_IDR4          PC_IDR_bit.IDR4
   // AD_PIN_IDR4 = 0 ;   //INPUT LOW    
    AD_PIN_DDR4 = 0 ;     //SET INPUT MODLE
    AD_PIN_CR14 = 0 ;     //浮空输入
   // AD_Pin_CR2 = 0;
}
//++++++++++++++++++++++++++++++start+++++++++++++++++++++++++++++++++++++++++++
//ADC初始化 配置寄存器
//-
----------------------------------------------------------------------------
void BSP_ADC_HardwareConfigure(void)
{
    CLK_PCKENR2 |= 0x01;     //使能ADC1时钟
    ADC1_CR1 |= 0x06 ;       // 12位AD值  EOC中断关闭 单次转换 
    ADC1_CR2 |= 0xa7;        // 时钟2分频 ADC_CR3_SMPT2  384Cycles   
    ADC1_TRIGR1 |= 0x10;     //TSON 设置内部ADC  
}
//++++++++++++++++++++++++++++++start+++++++++++++++++++++++++++++++++++++++++++
//ADC通道选型
//-----------------------------------------------------------------------------
void BSP_ADC_ChannalConfigure(void)
{
     ADC1_CR3 |= 0x04;        // ADC_CR3_CHSEL:0000 0100 通道选型4通道
}
//++++++++++++++++++++++++++++++start+++++++++++++++++++++++++++++++++++++++++++
//ADC启动转换
//-----------------------------------------------------------------------------
void BSP_ADC_Convert(void)
{
    ADC1_CR1 |= 0x01 ;  //ADC1_CR1_ADON 启动ADC 启动ADC电源  
}

//++++++++++++++++++++++++++++++start+++++++++++++++++++++++++++++++++++++++++++
//ADC 转换 获取AD值
//-----------------------------------------------------------------------------
INT16U BSP_AdcOnceValue(void)
{
    INT8U ADC1_H ;
    INT8U ADC1_L ;
    INT16U Adc1_Value;
    ADC1_H = ADC1_DRH ;          //先读高八位
    ADC1_L = ADC1_DRL ;          //读取低位值     
    Adc1_Value = (ADC1_H<<=8) +ADC1_L ; //两个八位数据合并成一个12位数据
    return Adc1_Value  ;       //返回12位ADC转换结果
}

//++++++++++++++++++++++++++++++start+++++++++++++++++++++++++++++++++++++++++++
//ADC转换完成标志：完成 返回数据BN_TRUE 
//-----------------------------------------------------------------------------
BOOLEAN BSP_ADC_Finish(void)
{
    if(ADC1_SR&0x01)
    {
        return BN_TRUE;
    }
    return BN_FALSE;
}
