
/*******************************************************************************
*
*	模块名称 : BSP背光模块
*	文件名称 : BSP_Backlight.c
*	版    本 : V1.0
*	说    明 : 1、模块独立，不访问其他任何模块
*                  2、供Mod_Backlight调用
                   3、硬件配置。
*	修改记录 :
*		版本号  日期        作者     说明
*		V1.0   2018-07-2  zhoujh  正式发布
*	Copyright (C), 2015-2020,   menredGroup
*             
*******************************************************************************/

//++++++++++++++++++++++++++++++start+++++++++++++++++++++++++++++++++++++++++++
#include ".\SnailDataTypedef.h"
#include ".\SnailMacro.h"
#include ".\iostm8l052r8.h"
#include "intrinsics.h"
//------------------------------E N D-------------------------------------------


//++++++++++++++++++++++++++++++start+++++++++++++++++++++++++++++++++++++++++++
//宏定义背光IO管脚寄存器宏定义
#define BACKLIGHT_PIN_ODR   PA_ODR_ODR3           
#define BACKLIGHT_PIN_DDR   PA_DDR_DDR3
#define BACKLIGHT_PIN_CR1   PA_CR1_C13
#define BACKLIGHT_PIN_CR2   PA_CR2_C23
//------------------------------E N D-------------------------------------------



//++++++++++++++++++++++++++++++start+++++++++++++++++++++++++++++++++++++++++++
//配置PG2口为推挽,初始化为低
void bsp_backlight_configure(void)
{
    BACKLIGHT_PIN_DDR = 1;        
    BACKLIGHT_PIN_CR1 = 1; 
    BACKLIGHT_PIN_CR2 = 0;
}
//------------------------------E N D-------------------------------------------


//++++++++++++++++++++++++++++++start+++++++++++++++++++++++++++++++++++++++++++
//开背光
void bsp_backlight_on(void)
{
    BACKLIGHT_PIN_ODR = 1;
}
//------------------------------E N D-------------------------------------------


//++++++++++++++++++++++++++++++start+++++++++++++++++++++++++++++++++++++++++++
//关背光
void bsp_backlight_off(void)
{
    BACKLIGHT_PIN_ODR = 0;
}
//------------------------------E N D-------------------------------------------


//-----------------------BSP_Backlight.c--END-----------------------------------
